In [1]:
import pandas as pd

In [24]:
%matplotlib inline

In [2]:
user_1 = {"id": "JOEL01", "name": "joel", "hair": "blondish"}
user_2 = {"id": "ZACH71", "name": "Zach", "hair": "brown"}
user_3 = {"id": "MATT92", "name": "Matt b.", "hair": "red"}
user_4 = {"id": "TRAV00", "name": "Travis", "hair": "brownish"}

In [9]:
user_data = pd.DataFrame([user_1, user_2, user_3, user_4]).set_index(["id"])

In [65]:
zach_foods = {"mushrooms": 5, "avocados": 0, "captain crunch": 5, "id": "ZACH71"}
joel_foods = {"mushrooms": 0, "avocados": 2, "captain crunch": 3, "id": "JOEL01"}
matt_foods = {"mushrooms": 2, "avocados": 3, "captain crunch": 4, "id": "MATT92"}
sarah_foods = {"mushrooms": 1, "avocados": 5, "captain crunch": 0, "id": "SARH00"}

In [66]:
user_foods = pd.DataFrame([zach_foods, joel_foods, matt_foods, sarah_foods])

In [39]:
user_data

            hair     name
id
JOEL01  blondish     joel
ZACH71     brown     Zach
MATT92       red  Matt b.
TRAV00  brownish   Travis

In [40]:
user_foods

   avocados  captain crunch      id  mushrooms
0         0               1  ZACH71          1
1         1               1  JOEL01          0
2         1               1  MATT92          1
3         1               0  SARH00          1

In [19]:
#help(pd.merge)

In [78]:
joined_df = pd.merge(user_data, user_foods, how="outer", right_on="id", left_index=True).set_index("id")

In [79]:
joined_df

            hair     name  avocados  captain crunch  mushrooms  picky_val
id
JOEL01  blondish     joel         2               3          0   1.666667
ZACH71     brown     Zach         0               5          5   4.000000
MATT92       red  Matt b.         3               4          2   3.266667
TRAV00  brownish   Travis       NaN             NaN        NaN        NaN
SARH00       NaN      NaN         5               0          1   2.133333

In [48]:
indexed_foods = user_foods.set_index("id")

In [49]:
indexed_foods

        avocados  captain crunch  mushrooms
id
ZACH71         0               1          1
JOEL01         1               1          0
MATT92         1               1          1
SARH00         1               0          1

In [50]:
user_data

            hair     name
id
JOEL01  blondish     joel
ZACH71     brown     Zach
MATT92       red  Matt b.
TRAV00  brownish   Travis

In [52]:
pd.merge(user_data, indexed_foods, left_index=True, right_index=True)

            hair     name  avocados  captain crunch  mushrooms
id
ZACH71     brown     Zach         0               1          1
JOEL01  blondish     joel         1               1          0
MATT92       red  Matt b.         1               1          1

In [57]:
user_data.join(indexed_foods)

            hair     name  avocados  captain crunch  mushrooms
id
JOEL01  blondish     joel         1               1          0
ZACH71     brown     Zach         0               1          1
MATT92       red  Matt b.         1               1          1
TRAV00  brownish   Travis       NaN             NaN        NaN

In [58]:
indexed_foods.join(user_data)

        avocados  captain crunch  mushrooms      hair     name
id
ZACH71         0               1          1     brown     Zach
JOEL01         1               1          0  blondish     joel
MATT92         1               1          1       red  Matt b.
SARH00         1               0          1       NaN      NaN

In [64]:
user_foods.join(user_data, on="id")

   avocados  captain crunch      id  mushrooms      hair     name
0         0               1  ZACH71          1     brown     Zach
1         1               1  JOEL01          0  blondish     joel
2         1               1  MATT92          1       red  Matt b.
3         1               0  SARH00          1       NaN      NaN

In [62]:
help(user_data.join)

Help on method join in module pandas.core.frame:

join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False) method of pandas.core.frame.DataFrame instance
    Join columns with other DataFrame either on index or on a key
    column. Efficiently Join multiple DataFrame objects by index at once by
    passing a list.

    Parameters
    ----------
    other : DataFrame, Series with name field set, or list of DataFrame
        Index should be similar to one of the columns in this one. If a
        Series is passed, its name attribute must be set, and that will be
        used as the column name in the resulting joined DataFrame
    on : column name, tuple/list of column names, or array-like
        Column(s) to use for joining, otherwise join on index. If multiples
        columns given, the passed DataFrame must have a MultiIndex. Can
        pass an array as the join key if not already contained in the
        calling DataFrame. Like an Excel VLOOKUP operation
    how : {'left', 'right', 'outer', 'inner'}
        How to handle indexes of the two objects. Default: 'left'
        for joining on index, None otherwise

        * left: use calling frame's index
        * right: use input frame's index
        * outer: form union of indexes
        * inner: use intersection of indexes
    lsuffix : string
        Suffix to use from left frame's overlapping columns
    rsuffix : string
        Suffix to use from right frame's overlapping columns
    sort : boolean, default False
        Order result DataFrame lexicographically by the join key. If False,
        preserves the index order of the calling (left) DataFrame

    Notes
    -----
    on, lsuffix, and rsuffix options are not supported when passing a list
    of DataFrame objects

    Returns
    -------
    joined : DataFrame

In [67]:
user_foods

   avocados  captain crunch      id  mushrooms
0         0               5  ZACH71          5
1         2               3  JOEL01          0
2         3               4  MATT92          2
3         5               0  SARH00          1

In [74]:
user_foods["picky_val"] = (user_foods.avocados + user_foods['captain crunch'] + (user_foods.mushrooms * 1.4)) / 3

In [75]:
user_foods

   avocados  captain crunch      id  mushrooms  picky_val
0         0               5  ZACH71          5   4.000000
1         2               3  JOEL01          0   1.666667
2         3               4  MATT92          2   3.266667
3         5               0  SARH00          1   2.133333